cases/HydrogenFlame-SteadyState/constant/combustionOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

homogeneousReactions on;	// chemistry on/off
minT  280.;			// minimum temperature in K (useful for steady-state)
maxT 3500.;			// maximum temperature in K (useful for steady-state)

combustionModel "ED";

ED
{
	A	4.;
	B	0.5;
}

EDFR
{
	A	4.;
	B	0.5;
}

EDC
{
	Ccsi 					2.1377;			// EDC parameter
	Ctau 					0.40825;		// EDC parameter
	maxGammaSquared 			0.75487766248;		// EDC parameter
	relTolerance				1e-7;			// ODE relative tolerance
	absTolerance				1e-12;			// ODE absolute tolerance
	numberOfResidenceTimes			100.;			// ODE total integration time
	numberIterationsToUpdateChemistry	5;			// number of CFD iteration to solve the ODE system
}

Spark
{
	spark           	on;
	position        	(5e-3  0 5.e-3);
	time            	0;
	temperature     	2500;
	duration        	50;
	diameter        	10e-3;
	additionalMassFraction	1e-3;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
