cases/HydrogenFlame-SteadyState/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.05;
        smoother        GaussSeidel;
        cacheAgglomeration off;
        nCellsInCoarsestLevel 20;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-06;
        relTol          0.01;
    }

    h
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.001;
    }

    e
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.001;
    }

    "(k|epsilon)"
    {
        $U;
        tolerance       1e-07;
        relTol          0.01;
    }

    Yi
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.001;
    }

    G
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.01;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    rhoMin          rhoMin [ 1 -3 0 0 0 ] 0.01;
    rhoMax          rhoMax [ 1 -3 0 0 0 ] 2.;

    residualControl
    {
	// species
        default         1e-5;

	// fluid dynamics fields
        p               1e-2;
        U               1e-4;
        h               1e-3;
	e               1e-3;
	G		1e-3;

        // turbulence fields
        k 		1e-3;
        epsilon 	1e-3;
        omega 		1e-3;
    }
}

relaxationFactors
{
    fields
    {
        p               0.20;
        rho             0.05;
    }
    equations
    {
	// species
        default         0.3;

	// fluid dynamics fields
        U               0.3;
        h               0.3;
	e               0.3;
	G		0.3;

	// turbulence fields
        k 		0.3;
        epsilon 	0.3;
        omega 		0.3;
    }
}


// ************************************************************************* //
